Revit 2027 API
CurveByPoints.SketchPlane Property
Override the SketchPlane property of CurveElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override SketchPlane SketchPlane { get; set; }
Public Overrides Property SketchPlane As SketchPlane
	Get
	Set
public:
virtual property SketchPlane^ SketchPlane {
	SketchPlane^ get () override;
	void set (SketchPlane^ value) override;
}
abstract SketchPlane : SketchPlane with get, set
override SketchPlane : SketchPlane with get, set
Property Value
SketchPlane
Remarks
CurveByPoints has no associated SketchPlane. Getting this property returns null. Setting it causes an InvalidOperationException.
See Also
Reference
CurveByPoints Class
Autodesk.Revit.DB Namespace